phase-4-project/what-should-we-eat-app/app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
    def index
        render json: Restaurant.all, status: :ok

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        restaurant = Restaurant.find(params[:id])